Вывод строки по буквам #84
Напишите программу, в которой переменной string присвоено значение, введённое пользователем. Тип переменной string — строка.

Программа должна вывести каждую букву переменной string на новой строке. То есть, если пользователь ввёл «Привет», программа должна вывести:

П
р
и
в
е
т
Чтобы пройти урок, вспомните кое‑что из прошлых уроков: как получить длину строки и как получить доступ к символу строки.


Наше решение
Обратите внимание на то, что сначала мы выводим нужную букву на экран и уже после этого увеличиваем переменную-счетчик.

string = input("Введите любую строку")
i = 0
while i < len(string):
    print(string[i])
    i += 1