Задача с чётными числами #82
Напишите программу, которая выводит на экран все четные числа начиная с 2 и заканчивая 20. Каждое из чисел должно быть выведено на новой строке. Для создания цикла используйте оператор while.

В этом уроке можно объявлять любые переменные и использовать их по своему усмотрению.

Наше решение
На самом деле все довольно просто. Тут стоит обратить внимание на то, что изначально значение переменной i равно 0. Однако еще до вывода переменной на экран ее значение увеличивается на 2.

i = 0
while i < 20:
    i += 2
    print(i)