Задача с выходом из цикла #86
Напишите программу, в которой переменной string присвоено значение, введённое пользователем. Тип переменной string — строка.

Программа должна вывести каждую букву переменной string на новой строке, используя цикл while. Если в строке встретятся два символа # подряд, цикл должен быть остановлен с помощью оператора break.

То есть, если пользователь ввёл «Привет, ##Василий», программа должна вывести только:

П
р
и
в
е
т
,
Чтобы пройти урок, вспомните кое‑что из прошлых уроков: как получить длину строки и как сделать срез строки.


Наше решение
Вариант со срезом

string = input("Введите любую строку")
i = 0
while i < len(string):
    if string[i:i+2] == "##":
        break
    print(string[i])
    i += 1
Вариант с методом find

string = input("Введите любую строку")
i = 0
sharps_pos = string.find("##")
while i < len(string):
    if i == sharps_pos:
        break
    print(string[i])
    i += 1