Задача с нечётными числами #83
Напишите программу, которая выводит на экран все нечетные числа начиная с 31 и заканчивая 11. Каждое из чисел должно быть выведено на новой строке. Для создания цикла используйте оператор while.

В этом уроке можно объявлять любые переменные и использовать их по своему усмотрению.


Наше решение
i = 31
while i > 9:
    print(i)
    i -= 2