Подсчёт одинаковых слов #124
В этом уроке нужно написать программу, которая получает строку от пользователя с помощью input. Программа должна разделить строку на слова по символу пробела, точке или запятой и подсчитать, сколько раз каждое из слов встречается в строке. Разбить на слова будет проще, если предварительно заменить точки и запятые на символы пробела. Слова должны считаться одинаковыми без учёта регистра. То есть «Питон» и «питон» — одно и тоже слово. Пустые слова, которые могут появится из‑за двух и более пробелов подряд, не должны участвовать в подсчёте.

Программа должна вывести слово, знак двоеточия и число раз, которое это слово встречается. Выглядеть это должно примерно так:

программировали : 2
да : 1
не : 1
выпрограммировали : 1
В этом уроке не будет конкретных указаний для выполнения. Думать придется самостоятельно. Однако, можно с уверенностью сказать, что знания о словарях вам пригодятся.

Наше решение
user_input = input('Введите что-нибудь')
# Преобразование в один регистр для того, чтобы
# слова "Привет" и "привет" считались одинаковыми
user_input = user_input.lower()
# Точки и запятые заменим на пробелы
# чтобы сразу и без проблем разбить строку
# на части с помощью split
user_input = user_input.replace('.', ' ')
user_input = user_input.replace(',', ' ')
words = {}

for word in user_input.split():
    # если слово уже есть в словаре words -- увеличиваем 
    # значение по этому ключу
    if word in words:
        words[word] +=1
    # если нет -- создаем ключ со значением 1
    else:
        words[word] = 1

# Выводим результат на экран
for word in words:
    print(word, ':', words[word])