Программа с функцией #134
В этом уроке нужно написать программу со своей функцией, которая высчитывает и выводит на экран факториал числа, введенного пользователем.

Факториал натурального числа n — это произведение всех натуральных чисел от 1 до n включительно.

В программе, первым делом, напишите функцию factorial, которая аргументом принимает n. Внутри функции расчитайте факториал и выведите результат на экран. Для расчета понадобится цикл. Используйте for или while на свое усмотрение. Также внутри функции понадобятся дополнительные переменные: назовите их, как хотите.

Затем нужно получить число от пользователя. Сделайте это с помощью input() и int().


Наше решение
def factorial(n):
    # В этом переменной мы будем
    # "накапливать" факториал числа
    result = 1
    for i in range(1, n + 1):
        # каждую итерацию цикла нужно умножать
        # число из последовательности на переменную result
        result = result * i
    print(result)

number = int(input('Введите число'))
factorial(number)