Сортировка одинаковых слов #126
У словарей, точно также как у списков и строк, есть методы. Их полное описание можно найти в справочнике .

Чтобы пройти этот урок, надо написать программу, которая делает тоже самое, что и в уроке «Подсчёт одинаковых слов» с одним лишь отличием — слова должны выводиться на экран в алфавитном порядке.

Для выполнения такой задачи пригодится метод словаря keys(), который возвращает ключи в виде коллекции, похожей на список. Чтобы эта коллекция стала действительно списком, ее нужно преобразовать с помощью функции list.

После этого отсортируйте получившийся список и с помощью цикла по нему выведите слова в алфавитном порядке, двоеточия и количество раз, которое встречается каждое слово.

То есть, если пользователь введет предложение «Первое слово, второе слово», программа должна вывести на экран

второе : 1
первое : 1
слово : 2


Наше решение
user_input = input('Введите что-нибудь')
# Преобразование в один регистр для того, чтобы
# слова "Привет" и "привет" считались одинаковыми
user_input = user_input.lower()
# Точки и запятые заменим на пробелы
# чтобы сразу и без проблем разбить строку
# на части с помощью split
user_input = user_input.replace('.', ' ')
user_input = user_input.replace(',', ' ')
words = {}

for word in user_input.split():
    # если слово уже есть в словаре words -- увеличиваем 
    # значение по этому ключу
    if word in words:
        words[word] +=1
    # если нет -- создаем ключ со значением 1
    else:
        words[word] = 1

# Получаем и сортируем список ключей словаря
keys = list(words.keys())
keys.sort()

# Выводим результат на экран
for word in keys:
    print(word, ':', words[word])
Цикл теперь идет по списку keys, а значения по‑прежнему получены из словаря words