Улучшенный подсчет слов #100
Предыдущая версия этой программы считала количество слов неверно, если пользователь вводил между словами больше одного пробела. Можете проверить, если конечно вы ее еще не удалили.

В этом уроке нужно написать программу, лишенную этого недостатка. В новой программе переменной string должно быть присвоено значение, введённое пользователем. Тип переменной string — строка. Также объявите переменную, в которую будет записываться количество слов. Назовите ее так, как хотите и присвойте начальное значение — ноль

С помощью метода строки split(' ') получите список элементов строки, разделенных пробелом. Запишите результат в какую‑нибудь переменную. Переберите получившийся список с помощью цикла for.

В каждой итерации надо проверять значение текущего элемента списка. Если этот элемент не пустая строка — прибавлять к переменной, в которой хранится количество слов, единицу.

После подсчета, программа должна вывести количество слов на экран.



Наше решение
Использую цикл for можно решить задачу примерно так

string = input("Введите что-нибудь")
words = string.split(" ")
count = 0

for w in words:
    if w: 
        count += 1
print(count)
Если внимательно прочитать описание метода split в справочнике, можно решить задачу намного проще

string = input("Введите что-нибудь")
words = string.split()
print(len(words))
Если не указывать разделитель в методе split, то будет использован алгоритм разбиения, а разделителем будет считаться последовательность пробельных символов. То есть, пустых слов в списке words не будет.