Функция enumerate #112
Иногда бывает нужно знать индекс элемента при переборе коллекции

i = 0
list_ = ["Первое слово", "Второе", "Третье слово"]
for e in list_:
    print(i, e)
    i += 1
Однако выглядит это так себе, и лучше воспользоваться функцией enumerate. С ее помощью в каждой итерации у нас будет кортеж из двух значений. Первый элемент этого кортежа — это индекс элемента последовательности. Второй — сам элемент последовательности. Распаковка и enumerate дают нам простое и красивое решение задачи

list_ = ["Первое слово", "Второе", "Третье слово"]
for i, e in enumerate(list_):
    print(i, e)
Функции enumerate можно передать и второй параметр — номер, с которого начинается нумерация элементов последовательности.

Чтобы пройти этот урок, напишите программу, которая делит введённое пользователем предложение на слова. Программа должна отфильтровать полученный список от пустых слов. Они могут появиться, если пользователь введет между словами больше одного пробела. После этого программа должна вывести на экран слова вместе с порядковыми номерами в предложении. Номера должны начинаться с единицы. То есть, если пользователь ввел «Китайские товары со всего мира», программа должна вывести на экран

1 Китайские
2 товары
3 со
4 всего
5 мира
Для решения можно использовать любые дополнительные переменные. Обязательно используйте функцию enumerate и цикл for.